'''
� Добавьте в модуль с загадками функцию, которая хранит
словарь списков.
� Ключ словаря - загадка, значение - список с отгадками.
� Функция в цикле вызывает загадывающую функцию, чтобы
передать ей все свои загадки
'''
__all__ = ['storage']

from task_04 import riddle


def storage():
    puzzles = {
        'Зимой и летом одним цветом': ['елка', 'ель', 'ёлка', 'сосна'],
        'Сидит дед, во сто шуб одет': ['лук', 'луковича', 'лучок'],
        'Не лает, не кусает, в дом не пускает': ['замок', 'домофон']
    }
    for puzzle, answers in puzzles.items():
        result = riddle(puzzle, answers)
        print(f'Угадал с {result}й попытки!' if result > 0 else 'Не угадал!')


if __name__ == '__main__':
    storage()
