'''
Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление. 
Функцию hex используйте для проверки своего результата.
'''
HEX = 16

num = int(input('Введите целое число: '))
res = ''
hex_digits = "0123456789ABCDEF"

while num:
    remainder = num % HEX
    res = hex_digits[remainder] + res
    num //= HEX

print(f'Шестнадцатеричное представление числа: 0x{res}')

num2 = hex(num)
print(f'Проверка результата: {num2}')
