'''
✔ Напишите программу, которая вычисляет площадь
круга и длину окружности по введённому диаметру.
✔ Диаметр не превышает 1000 у.е.
✔ Точность вычислений должна составлять
не менее 42 знаков после запятой.
'''

import math
import decimal

decimal.getcontext().prec = 50
PI = decimal.Decimal(math.pi)

d = decimal.Decimal(input('Введите диаметр окружности: '))
while d > 1000:
    print('Некорректный вывод!')
    d = decimal.Decimal(input('Введите диаметр окружности: '))
print(f'Площадь круга = {PI * (d/2)**2:.42f}\nДлина окружности = {PI * d:.42f}')
