'''
Добавьте в пакет, созданный на семинаре шахматный модуль. 
Внутри него напишите код, решающий задачу о 8 ферзях. 
Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. 
Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга. 
Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей. 
Если ферзи не бьют друг друга верните истину, а если бьют - ложь.
'''

queens = [(1, 1), (2, 3), (3, 5), (4, 7), (5, 2), (6, 4), (7, 6), (8, 8)]


def is_attacking(q1, q2):
    r1, c1 = q1
    r2, c2 = q2
    return (r1 == r2 or c1 == c2 or abs(r1 - r2) == abs(c1 - c2))

def check_queens(queens):
    n = len(queens)
    for i in range(n):
        for j in range(i + 1, n):
            if is_attacking(queens[i], queens[j]):
                return False
    return True

print(check_queens(queens))
