'''
Напишите код, который запрашивает число и сообщает является ли оно простым или составным. 
Используйте правило для проверки: “Число является простым, если делится нацело только на единицу и на себя”. 
Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
'''

# Задаём константы с лимитами на ввод чисел
LOWER_LIMIT = 0
UPPER_LIMIT = 10000

# Задаём число num -1 для входа в цикл while
num = LOWER_LIMIT - 1
# count для подсчёта количест делений
count = 0

# Запускаем цикл для ввода числа в заданном диапозоне
while num < LOWER_LIMIT or num > UPPER_LIMIT:
    num = int(input(f'Введите число от {LOWER_LIMIT} до {UPPER_LIMIT}: '))
    if num < LOWER_LIMIT - 1:
        print(f'Число {num} меньше заданного диапозона {LOWER_LIMIT}')
    elif num > UPPER_LIMIT:
        print(f'Число {num} больше заданного диапозона {UPPER_LIMIT}')
# Запускаем цикл для подсчёта количеств делений числа num на числа в диапозоне от 1 до num
for i in range(LOWER_LIMIT + 1, num + 1):
    if num % i == 0:
        count +=1
# Выводим результаты
if num == 0 or num == 1:
    print(f'Число {num} не является простым и не является составным')
elif count > 2:
    print(f'Число {num} является составным')
else:
    print(f'Число {num} является простым')
