'''
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.
'''

# Задаём стороны треугольника
a = 7
b = 3
c = 3

# Делаем проверку на существование треугольника
if a < b + c and b < a + c and c < a + b:
    # Делаем проверку на равнобедренность треугольника
    if a == b or a == c or b == c:
        # Делаем проверку на равносторонность треугольника
        if a == b == c:
            print('Треугольник является равносторонним')
        else:
            print('Треугольник является равнобедренным')
    else:
        print('Треугольник является разносторонним')
else:
    print('Треугольник не существует')
