'''
Программа загадывает число от 0 до 1000. Необходимо угадать число за 10 попыток. 
Программа должна подсказывать “больше” или “меньше” после каждой попытки. 
Для генерации случайного числа используйте код:
from random import randint
num = randint(LOWER_LIMIT, UPPER_LIMIT)
'''
from random import randint

# Устанавливаем лимиты на ограничение ввода чисел и количество попыток
LOWER_LIMIT = 0
UPPER_LIMIT = 1000
ATTEMPT = 10

# С помощью Random устанавливаем загаданное число и устанавливаем счётчик для подсчёта попыток
num = randint(LOWER_LIMIT, UPPER_LIMIT)
count = 0

# Просим угадать число и засчитываем одну попытку
answ = int(input(f'Угадайте загаданное число от {LOWER_LIMIT} до {UPPER_LIMIT} за {ATTEMPT} попыток: '))
count += 1

# Запускаем цикл с запросами числа пока пользователь угадает или не угадает загаданное число с оганиченным числом попыток
while (num != answ) and (ATTEMPT != 1):
    if answ > num:
        ATTEMPT -= 1
        count += 1
        answ = int(input(f'Число {answ} больше загаданного числа. У вас осталось {ATTEMPT} попыток: '))
    elif answ < num:
        ATTEMPT -= 1
        count += 1
        answ = int(input(f'Число {answ} меньше загаданного числа. У вас осталось {ATTEMPT} попыток: '))
# Выводим результат
if answ == num:
    print(f'Вы отгадали число {num} за {count} попыток')
else:
    print(f'У вас закончились попытки. Загаданное число было {num}')
